-- [DELETED] ТАБЛИЦА МРОТ ПО МЕСЯЦАМ И ПО РЕГИОНАМ. ЗАПОЛНЯТЬСЯ ДОЛЖНА ВРУЧНУЮ, ИЗ ЭКСЕЛЬ ФАЙЛА
CREATE MULTISET TABLE SBX_DB_SME_DKK_ANALYSE.BM_mrot,
  NO FALLBACK,
  NO BEFORE JOURNAL,
  NO AFTER JOURNAL,
  CHECKSUM = DEFAULT,
  DEFAULT MERGEBLOCKRATIO
  (
region_raw_old_tb_structure VARCHAR(512) CHARACTER SET Unicode NOT CaseSpecific,
region_cleared VARCHAR(512) CHARACTER SET Unicode NOT CaseSpecific Compress (NULL,'Алтайский край','Амурская область'
,'Архангельская область','Астраханская область','Белгородская область','Брянская область','Владимирская область','Волгоградская область'
,'Вологодская область','Вороежская область','г. Москва','г. Санкт-Петербург','г.Москва','г.Санкт-Петербург','Еврейская автономная область'
,'Забайкальский край','Ивановская область','Иркутская область','Кабардино-Балкарская Республика','Калининградская область'
,'Калужская область','Камчатский край','Кемеровская область','Кировская область','Костромская область','Краснодарский край'
,'Красноярский край','Курганская область','Курская область','Ленинградская область','Липецкая область','Магаданская область'
,'Московская область','Мурманская область','Ненецкий автономный округ','Нижегородская область','Новгородская область'
,'Новосибирская область','Омская область','Оренбургская область','Орловская область','Пензенская область','Пермский край','Приморский край'
,'Псковская область','Республика Адыгея','Республика Алтай (Горный Алтай)','Республика Башкортостан','Республика Бурятия'
,'Республика Дагестан','Республика Ингушетия','Республика Калмыкия','Республика Карачаево-Черкессия','Республика Карелия'
,'Республика Коми','Республика Марий Эл','Республика Мордовия','Республика Саха (Якутия)','Республика Северная Осетия-Алания'
,'Республика Татарстан','Республика Тыва','Республика Хакасия','Ростовская область','Рязанская область','Самарская область','Саратовская область'
,'Сахалинская область','Свердловская область','Смоленская область','Ставропольский край','Тамбовская область','Тверская область'
,'Томская область','Тульская область','Тюменская область','Удмуртская республика','Ульяновская область','Хабаровский Край'
,'Ханты-Мансийский автономный округ - Югра','Ханты-Мансийский АО - Югра','Челябинская область','Чеченская республика'
,'Чувашская Республика - Чувашия','Чукотский автономный округ','Ямало-Немецкий автономный округ'
,'Ямало-Ненецкий АО','Ярославская область'),
federal_district VARCHAR(512) CHARACTER SET Unicode NOT CaseSpecific Compress (NULL, 'Дальневосточный федеральный округ'
,'Приволжский федеральный округ','Северо-западный федеральный округ','Северо-Кавказский федеральный округ'
,'Сибирский федеральный округ','Уральский федеральный округ','Центральный федеральный округ','Южный федеральный округ'),
Minimal_salary DECIMAL(18,2) Compress (5205.00,5207.00,5277.00,5338.00,5500.00,5535.00,5554.00,5652.00,5683.00,5721.00,
5800.00,5864.00,5965.00,5995.00,6000.00,6100.00,6200.00,6204.00,6303.00,6372.00,6469.00,6492.79,6500.00,6614.00,6700.00,
6800.00,6845.00,6900.00,7000.00,7005.00,7090.00,7160.00,7240.00,7279.00,7500.00,7548.00,7600.00,7800.00,7918.00,7938.00,
8027.00,8252.00,8326.00,8500.00,8645.00,9000.00,9030.00,9112.00,9445.00,9489.00,9500.00,10000.00,10067.00,10250.00,
10440.00,11050.00,11163.00,11171.00,11280.00,11854.00,12000.00,12013.00,12075.00,12130.00,12075.00,12130.00,12200.00,
12400.00,12431.00,12515.00,14000.00,14440.00,15720.00),
Actual_from DATE format 'yyyy-mm-dd',
Actual_to DATE format 'yyyy-mm-dd'
)
PRIMARY INDEX (region_raw_old_tb_structure);

-- [DELETED]
INSERT INTO SBX_DB_SME_DKK_ANALYSE.BM_mrot(?,?,?,?,?,?)
SELECT * FROM SBX_DB_SME_DKK_ANALYSE.BM_mrot;

-- [DELETED]
CREATE MULTISET TABLE SBX_DB_SME_DKK_ANALYSE.BM_mrot_moving,
  NO FALLBACK,
  NO BEFORE JOURNAL,
  NO AFTER JUORNAL,
  CHECKSUM = DEFAULT,
  DEFAULT MERGEBLOCKRATIO
  (
    report_dt DATE Format 'dd.mm.yyyy',
    MROT_monthly DECIMAL(18,2),
    MROT_annual DECIMAL(18,2)
  )
  PRIMARY INDEX (report_dt);

-- [DELETED]
DELETE FROM SBX_DB_SME_DKK_ANALYSE.BM_mrot_moving;
-- [DELETED]
INSERT INTO SBX_DB_SME_DKK_ANALYSE.BM_mrot_moving (?,?,?);
SELECT * FROM SBX_DB_SME_DKK_ANALYSE.BM_mrot_moving;

-- [DELETED] ТАБЛИЦА С ПОМЕСЯЧНЫМИ ДОХОДАМИ
DROP TABLE SBX_DB_SME_DKK_ANALYSE.BM_client_incomes_per_month;
CREATE MULTISET TABLE SBX_DB_SME_DKK_ANALYSE.BM_client_incomes_per_month,
  NO FALLBACK,
  NO BEFORE JOURNAL,
  NO AFTER JOURNAL,
  CHECKSUM = DEFAULT,
  DEFAULT MERGEBLOCKRATIO
  (
   report_dt DATE Format 'yyyy-mm-dd',
   client_dk BIGINT DEFAULT -1,
   tb_old SMALLINT Compress (2, 13, 16, 18, 31, 36, 40, 42, 44, 49, 52, 54 55, 60, 67, 70, 77, 92, 99),
   osb_old SMALLINT Compress (2, 3, 1806, 17, 7954, 1569, 7970, 7977, 7978, 7981, 7982, 5940, 9013, 4157, 6984,
       6991, 9040, 9042, 7003, 9055, 5221, 8556, 5230, 8558, 9070, 8047, 8567, 7811, 8579, 7813, 8585, 8586, 8588,
       8589, 8590, 8591, 8592, 8593, 8594, 8595, 8596, 8597, 8598, 8599, 8600, 8601, 8602, 8603, 8604, 8605,
       5278, 8606, 8607, 8608, 5281, 8609, 8610, 8611, 8612, 8613, 8614, 8615, 8616, 8617, 8618, 8619, 8620,
       8621, 8622, 8623, 8624, 8369, 8625, 8626, 8627, 8628, 8629, 8630, 8631, 8632, 8633, 8634, 8635, 8636,
       8637, 8638, 8639, 8640, 8643, 8644, 8645, 8646, 8647, 8901, 1790, 1791),
   vsp_old SMALLINT Compress (0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 268, 14, 270, 526, 15, 16, 17, 18, 19, 20, 21,
   22, 23, 24, 280, 25, 26, 27, 28, 29, 30, 31, 32, 800, 34, 35, 38, 40, 41, 42, 43, 299, 44, 300, 45, 301, 46, 47,
   48, 49, 50, 306, 51, 52, 308, 53, 54, 55, 311, 56, 57, 313, 314, 60, 61, 62, 63, 64, 67, 69, 71, 72, 73, 330,
   77, 78, 80, 81, 84, 86, 87, 88, 600, 89, 90, 7770, 91, 7771, 7772, 93, 349, 7773, 94, 95, 7775, 96, 7777,
   98, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119,
   375, 121, 122, 123, 124, 125, 127, 128, 129, 130, 133, 134, 135, 136, 137, 393, 138, 139, 140
   141, 400, 145, 146, 149, 150, 151, 152, 153, 154, 155, 156, ,157, 158, 159, 160, 161, 162, 164, 166, 167, 168,
   169, 170, 171, 172, 174, 175, 182, 183, 186, 188, 700, 191, 192, 195, 196, 197, 200, 201, 202, 203, 205, 206, 208,
   720, 210, 723, 214, 727, 216, 728, 217, 1755, 226, 227, 228, 1764, 229, 231, 232, 233, 234, 235, 237, 243, 500, 245,
   246, 249, 254),
   salary_flag SMALLINT Compress (1,0,NULL),
   salary_sum DECIMAL (18,2) Compress (NULL, 5000.00, 10000.00, 3000.00, 4000.00, 2000.00, 6000.00. 13050.00,
   17400.00, 7000.00, 8700.00, 8000.00, 15000.00, 10440.00, 20000.00, 26100.00, 21750.00, 1000.00, 15660.00, 12000.00,
   10005.00, 20010.00, 9000.00, 34800.00, 30000.00, 30450.00, 6525.00, 11310.00, 6960.00, 3500.00, 2500.00, 12180.00,
   25000.00, 7830.00, 13920.00),
   pension_sum DECIMAL(18, 2) Compress (NULL, 2850.26, 2780.74, 2638.27, 2972.82, 2337.13, 2465.67, 2225.84, 5000.00,
   505.73, 518.37, 479.82, 540.66, 425.05, 448.43, 404.81, 2109.80, 300.00, 600.00, 1265.15, 1296.78, 1352.54, 1200.33,
   1063.32, 1012.69, 8803.00, 1121.80, 383.71, 800.00, 1775.07, 3000.00, 2731.32, 1731.77, 1851.40, 20000.00, 4451.68,
   2664.70, 4000.00, 1500.00, 2528.18, 25000.00, 2848.77, 4674.26, 1643.04, 2239.60, 621.00, 2000.00, 1455.50, 1600.00,
   2362.78, 8801.00, 2164.42, 1535.55, 2075.19, 1000.00, 5945.64, 1386.19, 2024.57, 2132.95, 1352.00, 1920.84, 1952.00,
   236.80, 4931.34, 8726.00, 8000.00, 1620.57, 10878.85, 2552.00, 5700.52, 1701.59, 809.62, 4894.00, 10574.23, 8680.00,
   6476.75, 11108.34, 6653.97, 8488.00, 1795.17, 6302.08, 7384.72)
   )
   PRIMARY AMP INDEX (report_dt, client_dk)
   PARTITION BY (COLUMN ADD 200. Range_N(report_dt BETWEEN DATE '2013-01-01' AND DATE '2022-12-31' EACH INTERVAL '1' MONTH));


DROP PROCEDURE SBX_DB_SME_DKK_ANALYSE.BM_client_incomes_per_month_procedure;
